scripts/assets/psl/0.orig/Uinj
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    default
    {
        type            slip;
    }
    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
 
    terrain
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
 
    inlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
 
    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    
    walls
    {
<<<WALLS_CONDITIONS>>>
    }
}
