scripts/assets/psl/0.orig/dsl_U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      dsl_U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    default
    {
        type            slip;
    }

    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
 
    terrain
    {
    	type            timeVaryingMappedFixedValue;
        // type                noSlip;
        //type            directionMixed;
        //refValue        uniform (0 0 0);
        //refGradient     uniform (0 0 0);
        //valueFraction   uniform (0 0 0 1 0 0);
        //value           uniform (0 0 0);
    }
 
    inlet
    {
        //type            inletOutlet;
        //value           $internalField;
        //inletValue      uniform (0 0 0);
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
 
    outlet
    {
    	//type            inletOutlet;
        //value           $internalField;
        //inletValue      uniform (0 0 0);
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    walls
    {
<<<WALLS_CONDITIONS>>>
    }
}


// ************************************************************************* //
