scripts/assets/psl/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.000765;

boundaryField
{
    top
    {
<<<TOP_CONDITIONS>>>
    }

    inlet
    {
<<<INLET_CONDITIONS>>>
    }

    outlet
    {
<<<OUTLET_CONDITIONS>>>
    }

    walls
    {
<<<WALLS_CONDITIONS>>>
    }

    terrain
    {
<<<TERRAIN_CONDITIONS>>>
    }
}


// ************************************************************************* //
