scripts/assets/psl/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    default
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    top
    {
<<<TOP_CONDITIONS>>>
    }

    inlet
    {
<<<INLET_CONDITIONS>>>
    }

    outlet
    {
<<<OUTLET_CONDITIONS>>>
    }

    walls
    {
<<<WALLS_CONDITIONS>>>
    }

    terrain
    {
<<<TERRAIN_CONDITIONS>>>
    }
}


// ************************************************************************* //
