scripts/assets/psl/system/controlDict

/*--------------------------------*- C++ -*----------------------------------*/

// File was generated by SwiftBlock, a Blender 3D addon.

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     <<<APPLICATION>>>;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         <<<END_TIME>>>;

deltaT          <<<DELTA_T>>>;

writeControl    adjustable;

writeInterval   <<<WRITE_INTERVAL>>>;

purgeWrite      0;

writeFormat     <<<WRITE_FORMAT>>>;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo           1.0;

maxAlphaCo      1.0;

maxDeltaT       1;

#include "pslControl"

functions {

  // profile {
  // 	type fieldMinMax;
  // 	libs        (fieldFunctionObjects);
  // 	fields (U);
  // 	
  // 	mode        magnitude;
  // }

  // #include "surfaces"

}

// ************************************************************************* //

