scripts/assets/psl/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      meshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

maxCellSize 50;
// minCellSize 3;
// boundaryCellSize 5;

surfaceFile "constant/surface.stl";

localRefinement
{
    terrain
    {
        additionalRefinementLevels 3;
    }

    walls
    {
        additionalRefinementLevels 0;
    }
    top
    {
        additionalRefinementLevels 0;
    }
    inlet
    {
        additionalRefinementLevels 0;
    }
    outlet
    {
        additionalRefinementLevels 0;
    }
}

renameBoundary
{
    defaultName wall;

    defaultType wall;

    newPatchNames
    {
        "top"
        {
            newName "top";
            type patch;
        }

        "terrain"
        {
            newName "terrain";
            type patch;
        }
        "walls"
        {
            newName "walls";
            type wall;
        }
        "inlet"
        {
            newName "inlet";
            type patch;
        }
        "outlet"
        {
            newName "outlet";
            type patch;
        }
    }
}


// ************************************************************************* //
