scripts/assets/psl/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

surfaces
{
  type surfaces;
  libs ("libsampling.so");
  fields (alpha.snow);
  interpolationScheme cellPoint;
  writeControl    writeTime;
  surfaceFormat   vtk;

  surfaces
  (
    isoAlpha
    {
      type isoSurfaceCell;
      isoField alpha.snow;
      isoValue 0.1;
      interpolate true;
    }
  );
}
